app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("single_access_token", "last_request_at", "crypted_password", "perishable_token", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES(E'hXQ1ev2PEmC0gXYsC-uh', '2009-12-19 22:22:50.765281', E'866acf53496e41587b905ef6bdcb506208c6c6c81a8c94a89bfbcabc7ab056d07a6c7c4dcfd0d9f247c467b6220f77ad0c43cb0d17be265b011bca5c0d9f1626', E'GGSYf3uNRoTErRQnopdX', 0, E'127.0.0.1', E'xzLkmsStIC_SUrNF5jeu', '2009-12-19 22:22:50.653763', E'36f4430d058cef4804068eb5182544cd1b3f4c703a1d36815bcbe26553025a2916db99fa0da747f1b24cdd734f5002d02983475fc0ce10e0d75f455dcd08bba2', 1, NULL, E'breccan', NULL, E'breccan@3months.com') RETURNING "id"